---
kind: other
id: Methods.T:Autodesk.Revit.DB.DetailCurveArrayIterator
source: html/fb99f2a5-3c4b-53dc-8754-ed902c7d48b2.htm
---
# DetailCurveArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.